{
  "experiencesPartDatas": [
    {
      "period": "Depuis 2023",
      "title": "Développeur front-end web et mobile",
      "text": "Poste obtenu chez Axelor à la fin de mes études d'ingénieur dans lequel j'utilise diverses technologies telles que React et React Native.",
      "location": "Champs-sur-Marne"
    },
    {
      "period": "2021 - 2023",
      "title": "Développeur full stack web et mobile",
      "text": "Poste obtenu chez LiveTonight dans le cadre de ma formation en apprentissage, j’ai eu l’occasion d’utiliser diverses technologies telles que React, React Native ou encore Ruby on Rails.",
      "location": "Paris"
    },
    {
      "period": "Juillet 2021",
      "title": "Développeur front-end web",
      "text": "Création en React du front-end d’une application web permettant de faciliter la gestion de commandes d’une entreprise.",
      "location": "Croissy-Beaubourg"
    },
    {
      "period": "Rentrée 2020",
      "title": "Développeur front-end mobile",
      "text": "Stage de deux mois dont l'objectif était de coder une application mobile en React Native.",
      "location": "Lagny-sur-Marne"
    }
  ],
  "projectsPartDatas": [
    {
      "title": "MainCode",
      "cardText": "Site vitrine de mon auto-entreprise.",
      "modalText": "Je souhaitais avoir une présence en ligne pour mon auto-entreprise afin de mettre en avant les services que je propose. C'est donc pour répondre à ce besoin que ce projet est né.\n\nLa création de ce site web a été l'occasion pour moi de me replonger dans le no-code avec WordPress. Cela m'a permis d'avoir rapidement un résultat plus que que convenable. Je me suis également chargé de l'hébergement. Pour ce faire, j'ai utilisé mes serveurs.",
      "links": [{
        "link": "https://maincode.fr/",
        "linkName": "Visiter MainCode"
      }],
      "tags": "WordPress",
      "period": "Septembre 2023"
    },
    {
      "title": "LiveTonight",
      "cardText": "Présentation d’une de mes réalisation en tant qu’apprenti.",
      "modalText": "LiveTonight est une plateforme qui a pour but de faciliter la réservation de musiciens et de DJs (recherche, mise en relation, paiement, gestion des démarches administratives). En tant qu'apprenti dans cette startup, j'ai eu l'occasion de travailler sur diverses projets. Pour éviter que ce soit trop lourd, je ne vais vous en présenter qu'un.\n\nLe projet que j'ai choisi de mettre en avant est le plus conséquent que l'on peut voir en tant que visiteur lambda. Ce dernier touche majoritairement au front-end.\nL'objectif était de refaire le page de présentation des musiciens et DJs. Nous voulions refaire cette page pour changer la technologie utilisée (passage de Ruby on Rails à React) et pour moderniser son apparence quelque peu vieillissante. Ainsi, je suis parti d'une page blanche.\nPour illustrer ce projet, voici un lien vers la page de présentation d'un des groupes du site de LiveTonight :",
      "links": [
        {
          "link": "https://livetonight.fr/groupe-musique-dj/1207-swing-cocktail",
          "linkName": "Page de Swing Cocktail"
        }
      ],
      "tags": "React Nx Apollo",
      "period": "2021 - 2023"
    },
    {
      "title": "Le matelas 365 - Thermoclean",
      "cardText": "Application mobile permettant de piloter une nappe chauffante en Bluetooth.",
      "modalText": "L'entreprise Le matelas 365 m'a contacté début 2023 au sujet de leur application permettant de contrôler une nappe chauffante à distance grâce au Bluetooth. Cette dernière devait être mise à jour pour rester sur les stores. J'ai décidé de repartir de zéro car certaines parties du code étaient peu lisibles et des bibliothèques qui n'étaient plus maintenues étaient utilisées. L'idée était d'obtenir une application avec des bases saines et solides pour pouvoir bien en faire le suivi.\nCette mission a été réalisée pour le compte de MainCode, mon auto-entreprise.\n\nL'application permet d'exécuter plusieurs actions sur la nappe chauffante :\n- la mettre en chauffe instantanément, en choisissant un thermostat et une durée\n- la programmer, en choisissant les jours de fonctionnement de la nappe, une heure de coucher, un thermostat et une durée ; l'utilisateur reçoit une notification aux moments définis et n'a qu'à cliquer dessus pour que la nappe se mette en chauffe\n- la passer en mode assainissement ; cette fonction fait monter la température de la nappe et dure 5 heures, cela permet de détruire les acariens et les principales bactéries qui peuvent se trouver dans les matelas.\nVous trouverez ci-dessous des liens redirigeant vers les stores où l'application est disponible. Vous pouvez la télécharger, mais pour bien la tester vous aurez besoin d'une nappe chauffante de chez Le matelas 365.",
      "links": [
        {
          "link": "https://play.google.com/store/apps/details?id=com.lematelas365.app",
          "linkName": "Page Google Play de Le matelas 365 - Thermoclean"
        },
        {
          "link": "https://apps.apple.com/fr/app/le-matelas-365-thermoclean/id6450447956",
          "linkName": "Page App Store de Le matelas 365 - Thermoclean"
        }
      ],
      "tags": "React Native Bluetooth",
      "period": "Mars - Juin 2023"
    },
    {
      "title": "Portfolio",
      "cardText": "Site personnel qui me présente en tant que développeur.",
      "modalText": "L'aboutissement de ce projet est le site sur lequel vous vous trouvez actuellement. L'idée c'est d'avoir un support numérique pour me présenter et présenter mon travail, un genre de CV amélioré.\n\nJe me suis occupé de la réalisation de ce site de A à Z, des maquettes sur Figma à la mise en production en passant par le développement.\nJ'ai décidé de laisser mon code en publique sur GitHub, si vous voulez le consulter, voici le lien :",
      "links": [
        {
          "link": "https://github.com/victorh95/Portfolio",
          "linkName": "Repo GitHub de mon portfolio"
        }
      ],
      "tags": "HTML CSS JavaScript",
      "period": "Novembre 2022"
    },
    {
      "title": "ArboRush v2",
      "cardText": "Application permettant de faciliter la gestion de son commerce en ligne.",
      "modalText": "Ce projet fait suite à ArboRush, d'où la mention \"v2\". Ainsi, pour bien le comprendre, il est conseillé d'aller voir la première version du projet. L'objectif était de partir des bases que nous avions pour faire un ERP qui s'adapte aux besoins et au budget des professionnels qui vendent sur les plateformes d'e-commerce. En somme, nous voulions créer une version améliorée d'ArboRush et la commercialiser. Malheureusement, pour diverses raisons, le projet a été stopé.\n\nCependant, au niveau du code, de belles avancées avaient été faites. Sur cette version, je me suis occupé à la fois du back-end et du front-end. Voici une liste de fonctionnalités que j'avais réussi à mettre en place :\n- inscription -> soit on possède une entreprise, soit on souhaite en rejoindre une (pour ce faire il faut utiliser l'identifiant de cette dernière)\n- connexion\n- déconnexion\n- gestion de son profil\n- gestion du profil de l'entrepise (pour accéder à cette page il faut avoir des droits particuliers)\n- gestion des membres de l'entrepise et de leurs autorisations (de même, pour accéder à cette page il faut avoir des droits particuliers)\n- possiblité de séparer les commandes en plusieurs rushs (gestion multi-tulisateurs)\n- liste des marges par jour et par rush.",
      "links": [],
      "tags": "Django PostgreSQL Bootstrap",
      "period": "Février - Juillet 2022"
    },
    {
      "title": "ArboRush (site vitrine)",
      "cardText": "Site vitrine du projet ArboRush v2.",
      "modalText": "Pour la deuxième version du projet ArboRush nous avions besoin d'un site vitrine présentant ce que nous prévoyions de faire. C'est donc pour répondre à ce besoin que ce projet est né.\n\nLa création de ce site web a été l'occasion pour moi de découvrir le no-code avec WordPress. Cela m'a permis d'avoir rapidement un résultat plus que que convenable. Je me suis également chargé de l'hébergement. Pour ce faire, j'ai utilisé mes serveurs.",
      "links": [],
      "tags": "WordPress",
      "period": "Juillet 2022"
    },
    {
      "title": "ArboRush v1",
      "cardText": "Interface web (front-end) pour faciliter la gestion de commandes.",
      "modalText": "L'objectif de ce projet était de réaliser une interface web facilitant la gestion de commandes. L'entreprise qui nous a confiée cette mission vend sur différentes plateformes d'e-commerce, d'où ce besoin.\n\nNous étions plusieurs à travailler sur ce projet. Personellement, je me suis occupé de la partie front-end.\nL'application que nous avons créée permet de lancer des rushs. Cela consiste à traiter une suite de commande provenant de diverses plateformes. Les différentes étapes du traitement d'une commande sont les suivantes :\n- mettre les objets commandés dans un cols (1)\n- entrer les informations du client sur la plateforme de l'expéditeur (2)\n- imprimer l'étiquette (3)\n- entrer les informations fournies par l'expéditeur sur la platforme d'où provient la commande pour que le client puisse suivre son colis (4)\n- confier le colis à l'expéditeur (5).\nNotre application automatise les étapes 2, 3 et 4, ce qui permet à l'entreprise qui nous a confié la mission de gagner un temps précieux.\nDe plus, l'application permet de voir la marge réalisé par jour.",
      "links": [],
      "tags": "React",
      "period": "Juillet 2021"
    },
    {
      "title": "hMessages",
      "cardText": "Application mobile de messagerie instantanée.",
      "modalText": "Ce projet est un challenge que je me suis lancé pour développer mes compétences en développement mobile. L'objectif était de créer une application de messagerie instantanée. Il s'agit du premier projet que j'ai poussé jusqu'à l'étape de production.\n\nSi vous voulez voir à quoi ressemble l'application hMessages, vous pouvez vous rendre sur sa page Google Play. Si vous le souhaitez, vous pouvez la tester, mais gardez bien en tête que cette application a plus de trois ans. De plus, comme je ne maintiens pas ce projet, il est possible que tout ne fonctionne plus correctement, voire même que l'application ne soit plus disponible au téléchargement.",
      "links": [
        {
          "link": "https://play.google.com/store/apps/details?id=tech.huger.messages",
          "linkName": "Page Google Play de hMessages"
        }
      ],
      "tags": "React Native",
      "period": "Octobre 2020"
    }
  ]
}
